# <font color="blue">Big Data Real-Time Analytics com Python e Spark</font>

## <font color="blue">Capítulo 3 - Manipulação de Dados em Python com Pandas</font>

In [1]:
# Versão da Linguagem Python
from platform import python_version
print('Versão da Linguagem Python Usada Neste Jupyter Notebook', python_version())

Versão da Linguagem Python Usada Neste Jupyter Notebook 3.9.12

In [2]:
# Importando o módulo Pandas
import pandas as pd

In [3]:
# Versões dos pacotes usados neste notebook
%reload_ext watermark
%watermark -a "Lucas Castro" --iversions

Author: Lucas Castro

pandas: 1.4.2

# Operações com DataFrames

### Parte 1

In [4]:
# Cria um dicionário com pares de chave e valor
stock = {'AMZN': pd.Series([346.15,0.59,459,0.52,589.8,158.88],
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E', 'Market Cap(B)']),
         'GOOG': pd.Series([1133.43,36.05,335.83,0.87,31.44,380.64],
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Beta', 'P/E', 'Market Cap(B)']),
         'FB': pd.Series([61.48,0.59,2450,104.93,150.92],
                         index = ['Closing price', 'EPS',' Shares Outstanding(M)', 'P/E', 'Market Cap(B)']),
         'YHOO': pd.Series([34.90,1.27,1010,27.48,0.66,35.36], 
                           index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Beta', 'Market Cap(B)']),
         'TWTR':pd.Series([65.25,-0.3,555.2,36.23],
                          index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'Market Cap(B)']),
         'AAPL':pd.Series([501.53,40.32,892.45,12.44,447.59,0.84],
                          index = ['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)', 'Beta'])}

In [5]:
# Tipo do objeto
type(stock)

dict

In [6]:
# Visualiza
stock

{'AMZN': Closing price            346.15
 EPS                        0.59
 Shares Outstanding(M)    459.00
 Beta                       0.52
 P/E                      589.80
 Market Cap(B)            158.88
 dtype: float64,
 'GOOG': Closing price            1133.43
 EPS                        36.05
 Shares Outstanding(M)     335.83
 Beta                        0.87
 P/E                        31.44
 Market Cap(B)             380.64
 dtype: float64,
 'FB': Closing price               61.48
 EPS                          0.59
  Shares Outstanding(M)    2450.00
 P/E                        104.93
 Market Cap(B)              150.92
 dtype: float64,
 'YHOO': Closing price              34.90
 EPS                         1.27
 Shares Outstanding(M)    1010.00
 P/E                        27.48
 Beta                        0.66
 Market Cap(B)              35.36
 dtype: float64,
 'TWTR': Closing price             65.25
 EPS                       -0.30
 Shares Outstanding(M)    555.20
 Market Cap(B)             36.23
 dtype: float64,
 'AAPL': Closing price            501.53
 EPS                       40.32
 Shares Outstanding(M)    892.45
 P/E                       12.44
 Market Cap(B)            447.59
 Beta                       0.84
 dtype: float64}

In [7]:
# Converte o dicionário em dataframe do pandas
stock_df = pd.DataFrame(stock); stock_df

                          AMZN     GOOG       FB     YHOO    TWTR    AAPL
 Shares Outstanding(M)     NaN      NaN  2450.00      NaN     NaN     NaN
Beta                      0.52     0.87      NaN     0.66     NaN    0.84
Closing price           346.15  1133.43    61.48    34.90   65.25  501.53
EPS                       0.59    36.05     0.59     1.27   -0.30   40.32
Market Cap(B)           158.88   380.64   150.92    35.36   36.23  447.59
P/E                     589.80    31.44   104.93    27.48     NaN   12.44
Shares Outstanding(M)   459.00   335.83      NaN  1010.00  555.20  892.45

In [8]:
# Podemos converter o dicionário em dataframe definindo quais são os índices de cada liha e ordem desejada
stock_df = pd.DataFrame(stock, 
                        index = ['Closing price',
                                 'EPS', 
                                 'Shares Outstanding(M)',
                                 'P/E', 
                                 'Market Cap(B)',
                                 'Beta'])

In [9]:
# Visualiza os dados
stock_df

                         AMZN     GOOG      FB     YHOO    TWTR    AAPL
Closing price          346.15  1133.43   61.48    34.90   65.25  501.53
EPS                      0.59    36.05    0.59     1.27   -0.30   40.32
Shares Outstanding(M)  459.00   335.83     NaN  1010.00  555.20  892.45
P/E                    589.80    31.44  104.93    27.48     NaN   12.44
Market Cap(B)          158.88   380.64  150.92    35.36   36.23  447.59
Beta                     0.52     0.87     NaN     0.66     NaN    0.84

In [10]:
# Podemos converter o dicionário em dataframe definido quais são os índices de cada linha e os títulos das colunas
stock_df = pd.DataFrame(stock,
                       index = ['Closing price',
                               'EPS',
                               'Shares Outstanding(M)',
                               'P/E',
                               'Market Cap(B)',
                               'Beta'],
                       columns = ['AMZN', 'GOOG', 'FB']); stock_df

                         AMZN     GOOG      FB
Closing price          346.15  1133.43   61.48
EPS                      0.59    36.05    0.59
Shares Outstanding(M)  459.00   335.83     NaN
P/E                    589.80    31.44  104.93
Market Cap(B)          158.88   380.64  150.92
Beta                     0.52     0.87     NaN

In [11]:
# Índices
stock_df.index

Index(['Closing price', 'EPS', 'Shares Outstanding(M)', 'P/E', 'Market Cap(B)',
       'Beta'],
      dtype='object')

In [12]:
# Colunas
stock_df.columns

Index(['AMZN', 'GOOG', 'FB'], dtype='object')

### Parte 2

In [13]:
# Dicionário
Quadro_Medalhas_Olimpiada = {
    'EUA' : {'Ouro':46, 'Prata':37, 'Bronze':38},
    'China':{'Ouro':26, 'Prata':18, 'Bronze':26},
    'Inglaterra':{'Ouro':27, 'Prata':23, 'Bronze':17},
    'Alemanha':{'Ouro':19, 'Prata':18, 'Bronze':19},
    'Uruguai':{'Ouro':17, 'Prata':10, 'Bronze':15}}

In [14]:
# Converte para dataframe
df_olimpiada = pd.DataFrame.from_dict(Quadro_Medalhas_Olimpiada)

In [15]:
type(df_olimpiada)

pandas.core.frame.DataFrame

In [16]:
df_olimpiada.head()

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [17]:
df_olimpiada['China']

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [18]:
Medalhas_China = df_olimpiada['China']

In [19]:
type(Medalhas_China)

pandas.core.series.Series

In [20]:
Medalhas_China

Ouro      26
Prata     18
Bronze    26
Name: China, dtype: int64

In [21]:
df_olimpiada.Uruguai

Ouro      17
Prata     10
Bronze    15
Name: Uruguai, dtype: int64

In [22]:
df_olimpiada[['Alemanha','EUA']]

        Alemanha  EUA
Ouro          19   46
Prata         18   37
Bronze        19   38

In [23]:
df_olimpiada.get('Inglaterra')

Ouro      27
Prata     23
Bronze    17
Name: Inglaterra, dtype: int64

In [24]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

### Parte 3

In [25]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [26]:
df_olimpiada[:2]

       EUA  China  Inglaterra  Alemanha  Uruguai
Ouro    46     26          27        19       17
Prata   37     18          23        18       10

In [27]:
df_olimpiada[2:]

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15

In [28]:
df_olimpiada[::-2]

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15
Ouro     46     26          27        19       17

In [29]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [30]:
df_olimpiada.loc['Ouro']

EUA           46
China         26
Inglaterra    27
Alemanha      19
Uruguai       17
Name: Ouro, dtype: int64

In [31]:
df_olimpiada.loc[:,'EUA']

Ouro      46
Prata     37
Bronze    38
Name: EUA, dtype: int64

In [32]:
df_olimpiada.loc['Prata']['China']

18

In [33]:
df_olimpiada.loc['Prata']

EUA           37
China         18
Inglaterra    23
Alemanha      18
Uruguai       10
Name: Prata, dtype: int64

In [34]:
df_olimpiada.loc['Ouro']>20

EUA            True
China          True
Inglaterra     True
Alemanha      False
Uruguai       False
Name: Ouro, dtype: bool

In [35]:
df_olimpiada.loc['Ouro', df_olimpiada.loc['Ouro']>20]

EUA           46
China         26
Inglaterra    27
Name: Ouro, dtype: int64

In [36]:
# Isso não é inválido:
#df_olimpiada['Ouro', df_olimpiada.loc['Ouro']>20]

In [37]:
df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [38]:
# iloc para buscar a linha de índice 0
df_olimpiada.iloc[0]

EUA           46
China         26
Inglaterra    27
Alemanha      19
Uruguai       17
Name: Ouro, dtype: int64

In [39]:
# iloc para buscar a linha de índice 2
df_olimpiada.iloc[2]; df_olimpiada

        EUA  China  Inglaterra  Alemanha  Uruguai
Ouro     46     26          27        19       17
Prata    37     18          23        18       10
Bronze   38     26          17        19       15

In [40]:
df_olimpiada.iloc[:2]

       EUA  China  Inglaterra  Alemanha  Uruguai
Ouro    46     26          27        19       17
Prata   37     18          23        18       10

In [41]:
df_olimpiada.iloc[2,0:2]

EUA      38
China    26
Name: Bronze, dtype: int64

In [42]:
df_olimpiada.iloc[2:3, :]

        EUA  China  Inglaterra  Alemanha  Uruguai
Bronze   38     26          17        19       15

In [43]:
df_olimpiada.iloc[1,:]

EUA           37
China         18
Inglaterra    23
Alemanha      18
Uruguai       10
Name: Prata, dtype: int64

In [44]:
df_olimpiada.iloc[2, 0]

38

> Podemos ainda deletar partes no dataframe

In [45]:
del df_olimpiada['EUA']

In [46]:
df_olimpiada

        China  Inglaterra  Alemanha  Uruguai
Ouro       26          27        19       17
Prata      18          23        18       10
Bronze     26          17        19       15

> Bem como podemos inserir no dataframe.

In [47]:
df_olimpiada.insert(0, 'Brasil', (17, 16, 23)); df_olimpiada

        Brasil  China  Inglaterra  Alemanha  Uruguai
Ouro        17     26          27        19       17
Prata       16     18          23        18       10
Bronze      23     26          17        19       15

In [48]:
df_olimpiada.describe()

          Brasil      China  Inglaterra   Alemanha    Uruguai
count   3.000000   3.000000    3.000000   3.000000   3.000000
mean   18.666667  23.333333   22.333333  18.666667  14.000000
std     3.785939   4.618802    5.033223   0.577350   3.605551
min    16.000000  18.000000   17.000000  18.000000  10.000000
25%    16.500000  22.000000   20.000000  18.500000  12.500000
50%    17.000000  26.000000   23.000000  19.000000  15.000000
75%    20.000000  26.000000   25.000000  19.000000  16.000000
max    23.000000  26.000000   27.000000  19.000000  17.000000

# FIM